Revit 2027 API
AnalysisDisplayColorSettings(AnalysisDisplayColorSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayColorSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColorSettings(
	AnalysisDisplayColorSettings other
)
Public Sub New (
	other As AnalysisDisplayColorSettings
)
public:
AnalysisDisplayColorSettings(
	AnalysisDisplayColorSettings^ other
)
new :
        other : AnalysisDisplayColorSettings -> AnalysisDisplayColorSettings
Parameters
other AnalysisDisplayColorSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayColorSettings Class
AnalysisDisplayColorSettings Overload
Autodesk.Revit.DB.Analysis Namespace